Revit 2027 API
ClassificationEntry.HasBadCategoryId Method
 Checks if the category id is Revit BuiltInCategory id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasBadCategoryId()
Public Function HasBadCategoryId As Boolean
public:
bool HasBadCategoryId()
member HasBadCategoryId : unit -> bool
Return Value
Boolean
 True if the category id is not Revit BuiltInCategory id. False otherwise.
See Also
Reference
ClassificationEntry Class
Autodesk.Revit.DB Namespace